app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @article = Article.find_by_id(params[:id])
    @user = User.find_by_id(params[:id])

INSERT INTO "users" ("first_name", "last_name", "email", "user_name", "image_url", "course_taken", "city", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.image_url == ""
      @user.image_url = "http://i.imgur.com/DMABUhJ.png"
    end
    if @user.save